content-org/all-posts.org
#+setupfile: setup.org
#+hugo_section: post
#+seq_todo: TODO DRAFT DONE
#+hugo_front_matter_key_replace: lastmod>mylastmod
#+hugo_front_matter_format: yaml
#+macro: unsplash @@hugo:{{< unsplash leading="$1" id="$2" name="$3" >}}@@
#+macro: pixabay @@hugo:{{< pixabay >}}$1{{< /pixabay >}}@@
#+macro: pexels @@hugo:{{< pexels leading="$1" id="$2" name="$3">}}@@
#+macro: lastmod @@hugo:{{< lastmod >}}@@
#+macro: begin_callout @@hugo:{{% callout $1 %}}@@
#+macro: end_callout @@hugo:{{% /callout %}}@@
#+macro: toc @@html:{{< toc >}}@@

** DRAFT Academic テーマへの移行手順                              :emacs:hugo:ox_hugo:
:PROPERTIES:
:EXPORT_FILE_NAME: index
:EXPORT_HUGO_BUNDLE: 2020-01-25_migrate-to-hugo-academic
:EXPORT_HUGO_SLUG: random
:EXPORT_DATE: 2019-01-05
:END:

org-mode ではタグにハイフンを付けられない。

=ox_hugo= ~hoge~

conf-toml がある https://github.com/dryman/toml-mode.el/issues/14

#+begin_src emacs-lisp
(use-package ox-hugo
  :after ox
  :init
  (defalias 'toml-mode 'conf-toml-mode)
  :config 
  (setq org-hugo-use-code-for-kbd t))
#+end_src

https://github.com/sourcethemes/academic-scripts に page bunlde 化するスクリプトがある。

#+begin_src sh
asdf plugin add hugo https://github.com/beardix/asdf-hugo
#+end_src


=baseurl= を設定しないと Twitter Card などが表示されないので気をつけよう

#+begin_src toml
# The URL of your site.
# End your URL with a `/` trailing slash, e.g. `https://example.com/`.
baseurl = "https://www.yewton.net/"
#+end_src

=google_tag_manager= が設定されていると Google Analytics のコードが埋め込まれない
https://spectrum.chat/academic/help/google-analytics-not-working-for-me~3e802803-663f-4b38-8d6f-bc645935da26?authed=true

*** ox-hugo alias

#+begin_example
:EXPORT_HUGO_ALIASES: /2019/01/happy-new-year/
#+end_example


*** hugo-academic のデフォが removePathAccents=true な注意

サーチコンソール
ゲーム感想 → ケーム感想になってた
